/// Напишите программу, которая на вход принимает число и
//    выдает его квадрат (т.к. число умноженное само на себя)

Console.WriteLine("Write a number: ");

int a = int.Parse(Console.ReadLine());
Console.WriteLine(a * a);
