// начинаем с 1, не получится двигаться с двойкой. Нужно либо игнорировать, либо начать с четного
//надо + num%2 сделать, а потом шагать +2
// не звыбть условия выхода
// потом четность/нечетность, потом вывод


// Задача 1: Задайте значения M и N. Напишите программу, которая выведет все
// чётные натуральные числа в промежутке от M до N с помощью рекурсии.
// M = 1; N = 5 -> "2, 4"
// M = 4; N = 8 -> "4, 6, 8"

//Задача 2: Задайте значения M и N. Напишите программу, которая найдёт сумму
//натуральных элементов в промежутке от M до N с помощью рекурсии.
//M = 1; N = 15 -> 120
//M = 4; N = 8 -> 30


// https://youtu.be/rh1mP02NFoM?t=229
// https://skillbox.ru/media/code/rekursiya-vokrug-nas/
// https://docs.microsoft.com/ru-ru/archive/msdn-magazine/2012/december/csharp-matrix-decomposition


